[
    {
      "name": "Machine Learning and Neural Networks for Movie ratings prediction.",
      "description": "Achieved 91% accuracy in predicting IMDb movie ratings using machine learning algorithms and neural networks such as Random Forest, XGBoost, and Decision Trees. Proficient in data processing and exploratory data analysis using Python facilitating informed decision-making.",
      "link": "",
      "tech_used": ["Python","Predictive Analysis"],
      "tags": ["Data Science", "Machine Learning"]
    },
    {
      "name": "Machine Learning and Forecasting Techniques for Economics of a country",
      "description": "Constructed Machine Learning models with an accuracy of 97% to forecast economical conditions, including regression analysis and Time series analysis. Executed data manipulation and processing using numpy and pandas to integrate economic indicators.",
      "link": "",
      "tech_used": ["Python","Machibne learning"],
      "tags": ["Data Science", "Machine Learning"]
    },
    {
      "name": "Sentiment Analysis on Twitter dataset",
      "description": "",
      "link": "",
      "tech_used": ["Python", "Natural Language Processing", "Keras"],
      "tags":["Data Science", "Machine Learning"]
    },
    {
      "name": "Real-time Chat Application",
      "description": "Developed ChitChat, an application enabling real-time private and group chat functionalities in MERN Stack. Implemented secure user authentication via email and responsive UI for seamless user experience.",
      "link": "https://example.com/project-three",
      "tech_used": ["React", "Node.js", "Express", "MongoDB"],
      "tags": ["Development"]
    },
    {
      "name": "",
      "description": "This is a description for Project Four. It is a mobile application built with React Native.",
      "link": "https://example.com/project-four",
      "tech_used": ["HTML", "CSS", "JavaScript", "Django"],
      "tags": ["Development"]
    },
    {
      "name": "Clinical Text Summarisation using LLMs",
      "description": "Implemented Text Generation and Summarization system using BERT and Summarizer Model to condense clinical transcriptions into concise summaries enhancing healthcare documentation.",
      "link": "https://example.com/project-four",
      "tech_used": ["Bert", "GPT", "Python"],
      "tags": ["Machine Learning"]
    }
  ]
  
