  [
    {
      "name": "Music Recommendation System",
      "smalldesc": "",
      "description": [
        "Analyzed the Spotify songs dataset to perform clustering using K-means algorithm based on audio features, optimizing the solution through the Elbow Method with a 20% improvement in clustering quality.",
        "Applied Principal Component Analysis (PCA) for dimensionality reduction and enhancing visualization of clustering results.",
        "Developed a recommendation engine leveraging cosine similarity for computing similarity scores between user input and formed clusters, achieving an 85% accuracy in predicting user preferences."
      ],
      "link": "",
      "tech_used": ["Python", "Machine Learning"],
      "tags": ["Data Science", "Machine Learning"]
    },
    {
      "name": "Email Spam Detection",
      "smalldesc": "",
      "description": [
        "Utilized the Natural Language Toolkit (NLTK) for text preprocessing, including tokenization, lemmatization, and stemming.",
        "Built and trained classification models using Naive Bayes, Logistic Regression, and Support Vector Machines (SVM) algorithms to classify emails as spam or legitimate, with 89% accuracy.",
        "Addressed class imbalance using Synthetic Minority Over-sampling Technique (SMOTE) to generate samples, achieving a 10% increase in precision and a 12% increase in recall, as determined by confusion matrix analysis."
      ],
      "link": "",
      "tech_used": ["Python", "Natural Language Processing", "NLTK"],
      "tags": ["Data Science", "Machine Learning"]
    },
    {
      "name": "Chat Application - ChitChat",
      "smalldesc": "",
      "description": [
        "Developed ChitChat, a real-time chat application using the MERN stack for enabling user communication.",
        "Implemented secure user authentication, incorporating JSON Web Tokens (JWT) user sessions management and real-time communication features using Socket.io, facilitating instant message delivery and typing indicators."
      ],
      "link": "",
      "tech_used": ["MongoDB", "Express.js", "ReactJS", "Node.js"],
      "tags": ["Web Development", "Real-Time Applications"]
    },
    {
      "name": "Web Application - Route2Care",
      "smalldesc": "",
      "description": [
        "Designed an E-commerce website for medicines using HTML, JavaScript, and Django backend with user authentication, secure payment gateway, prescription validation, and responsive design.",
        "Implemented Optical Character Recognition (OCR) with 95% accuracy to process and validate prescriptions for enhanced security."
      ],
      "link": "",
      "tech_used": ["HTML", "JavaScript", "Django"],
      "tags": ["Web Development", "E-commerce"]
    },
    {
      "name": "Sentiment Analysis on Twitter dataset",
      "description": "Conducted sentiment analysis on Twitter data of 1.6M tweets for classification of tweets as positive or negative. Leveraged NLTK for text preprocessing, ML algorithms and keras library for building a classification model.",
      "link": "",
      "tech_used": ["Python", "Natural Language Processing", "Keras"],
      "tags":["Data Science", "Machine Learning"]
    },
    {
      "name": "Clinical Text Summarisation using LLMs",
      "description": "Implemented Text Generation and Summarization system using BERT and Summarizer Model to condense clinical transcriptions into concise summaries enhancing healthcare documentation.",
      "link": "",
      "tech_used": ["Bert", "GPT", "Python"],
      "tags": ["Machine Learning"]
    },
    {
      "name": "Wolf Parking Management",
      "description": "Developed and implemented WolfParking, a SQL and Java parking management system for university campus, utilizing MariaDB. Designed functionalities for administrators to efficiently oversee parking lots, assign zones/spaces, issue permits, and enforce regulations through a command-line interface. Integrated MariaDB with Java using JDBC to enable seamless data operations",
      "link": "",
      "tech_used": ["Python", "Natural Language Processing", "Keras"],
      "tags":["Data Science", "Machine Learning"]
    }
  ]
